---
kind: property
id: P:Autodesk.Revit.DB.Connector.AllowsSlopeAdjustments
zh: 连接件、接口
source: html/40b51860-4cf0-9f48-de98-4592ccf43532.htm
---
# Autodesk.Revit.DB.Connector.AllowsSlopeAdjustments Property

**中文**: 连接件、接口

Indicates if the connector allows the slope adjustment.

## Syntax (C#)
```csharp
public bool AllowsSlopeAdjustments { get; }
```